app/Controllers/CaisseController.php

    public function getPage() {
        $data['caisses'] = $this->caisse->findAll();
---
SELECT *
FROM `caisses`